load-tests/shelter-normal-load.yml
config:
  target: "{{ $env.API_BASE_URL }}"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 2
      name: "Warm up shelter dashboard traffic"

    - duration: 60
      arrivalRate: 2
      name: "Sustained normal shelter traffic"

  defaults:
    headers:
      Authorization: "Bearer {{ $env.SHELTER_ACCESS_TOKEN }}"

scenarios:
  - name: "Shelter dashboard read flow"
    flow:
      - get:
          url: "/organisation-profile/me"

      - think: 1

      - get:
          url: "/pet-listings/me"