load-tests/shelter-stress-read.yml
# Stress test for the shelter dashboard, gradually increasing read-only traffic
# to the organisation profile and pet listings endpoints before sustaining a high load.

config:
  target: "{{ $env.API_BASE_URL }}"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 4
      name: "Ramp from normal to busy shelter traffic"

    - duration: 60
      arrivalRate: 4
      rampTo: 8
      name: "Increase shelter traffic"

    - duration: 60
      arrivalRate: 8
      rampTo: 12
      name: "Push beyond normal shelter traffic"

    - duration: 60
      arrivalRate: 12
      name: "Sustain shelter stress level"

  defaults:
    headers:
      Authorization: "Bearer {{ $env.SHELTER_ACCESS_TOKEN }}"

scenarios:
  - name: "Shelter read-only stress flow"
    flow:
      - get:
          url: "/organisation-profile/me"

      - think: 1

      - get:
          url: "/pet-listings/me"